Repository: kusutori/Tonarink
Catalog: src/Tonarink.App/Strings/*/App.resw
Source language: en_us
Languages: zh_cn

source: Accept
zh_cn: 接受

source: Add
zh_cn: 添加

# AddFavoriteTitle
source: Add to favorites
zh_cn: 添加到收藏夹

source: Add folder
zh_cn: 添加文件夹

# AutoSaveDescription
source: Choose how incoming content is handled.
zh_cn: 选择收到内容时的处理方式。

# AutoSaveFavorites
source: Favorites
zh_cn: 收藏设备

# AutoSaveOff
source: Off
zh_cn: 关闭

# AutoSaveOn
source: On
zh_cn: 开启

# AutoSaveTitle
source: Auto save
zh_cn: 自动保存

source: Cancel
zh_cn: 取消

source: Cancel current send
zh_cn: 取消当前发送

source: Cancel current transfer
zh_cn: 取消当前传输

source: Cancelled
zh_cn: 已取消

source: Cancelling transfer…
zh_cn: 正在取消传输…

source: Change…
zh_cn: 更改…

# ChangeSaveLocation
source: Change the location where received files are saved
zh_cn: 更改接收文件保存位置

source: Choose content
zh_cn: 选择内容

source: Choose {item}
zh_cn: 选择{item}

# DropFilesCaption
source: Add to send list
zh_cn: 添加到待发送列表

# DropFilesOrFolders
source: Drop files or folders here
zh_cn: 拖放文件或文件夹到此处

# DropItemsFailed
source: Could not add dropped items: {error}
zh_cn: 无法添加拖放的项目：{error}

# DroppedItemsEmpty
source: The dropped items contain no accessible files.
zh_cn: 拖放的项目中没有可访问的文件。

# ReleaseFilesToAdd
source: Release to add
zh_cn: 释放以添加

source: Clear
zh_cn: 清空

source: Clipboard
zh_cn: 剪贴板

# ClipboardEmpty
source: The clipboard has no text, files, or folders that can be sent.
zh_cn: 剪贴板中没有可发送的文本、文件或文件夹。

source: Clipboard image
zh_cn: 剪贴板图片

# ClipboardReadFailed
source: Could not read the clipboard: {error}
zh_cn: 无法读取剪贴板：{error}

source: Clipboard text
zh_cn: 剪贴板文本

source: Close
zh_cn: 关闭

# Confirm
source: OK
zh_cn: 确定

# ContentManyItems
source: {count} items
zh_cn: {count} 个项目

# ContentOneFile
source: File {file}
zh_cn: 文件 {file}

# ContentOneTextMessage
source: A text message
zh_cn: 一条文本消息

source: Content saved.
zh_cn: 内容已保存。

source: Copied
zh_cn: 已复制

source: Copy
zh_cn: 复制

source: Copy received text
zh_cn: 复制收到的文本

source: Decline
zh_cn: 拒绝

source: Delete
zh_cn: 删除

# DeleteFavoriteConfirm
source: Are you sure you want to remove “{device}” from favorites?
zh_cn: 确定要删除收藏“{device}”吗？

# DeleteFavoriteTitle
source: Delete favorite
zh_cn: 删除收藏

# DeviceInfo
source: Device information
zh_cn: 设备信息

# DeviceInfoAlias
source: Alias (device name):
zh_cn: 别名（设备名称）：

# DeviceInfoNoAddress
source: No address available
zh_cn: 暂无可用地址

# DeviceInfoPort
source: Port:
zh_cn: 端口：

# DeviceDesktop
source: Desktop
zh_cn: 桌面设备

# DeviceHeadless
source: Headless device
zh_cn: 无界面设备

# DeviceMobile
source: Mobile device
zh_cn: 移动设备

source: Device name
zh_cn: 设备名称

# DeviceServer
source: Server
zh_cn: 服务器

# DeviceWeb
source: Web device
zh_cn: 网页设备

source: Edit favorite
zh_cn: 编辑收藏

source: Edit favorite {device}
zh_cn: 编辑收藏 {device}

# EditFavoriteTitle
source: Edit favorite device
zh_cn: 编辑收藏设备

source: Favorite {device}
zh_cn: 收藏 {device}

source: Favorite device name
zh_cn: 收藏设备名称

# FavoriteIpAddress
source: Favorite device IP address
zh_cn: 收藏设备 IP 地址

# FavoritePort
source: Favorite device port
zh_cn: 收藏设备端口

source: File
zh_cn: 文件

# Fingerprint
source: Fingerprint {fingerprint}…
zh_cn: 指纹 {fingerprint}…

source: Folder
zh_cn: 文件夹

# FolderEmpty
source: The selected folder has no files that can be sent.
zh_cn: 所选文件夹中没有可发送的文件。

# HistoryBack
source: Back
zh_cn: 返回

# HistoryDeleteAll
source: Delete history
zh_cn: 删除历史

# HistoryDeleteAllConfirm
source: Delete receive history?
zh_cn: 删除接收历史？

# HistoryDeleteAllConfirmMessage
source: This removes the local history list. Files already saved on disk are not deleted.
zh_cn: 这只会清空本机历史列表，不会删除已经保存到磁盘的文件。

# HistoryDeleteItem
source: Remove from history
zh_cn: 从历史记录中删除

# HistoryEmpty
source: No received files yet.
zh_cn: 还没有收到过文件。

# HistoryEntryActions
source: Actions for {file}
zh_cn: {file} 的操作

# HistoryInfo
source: Info
zh_cn: 信息

# HistoryInfoFileName
source: File name
zh_cn: 文件名

# HistoryInfoPath
source: Path
zh_cn: 路径

# HistoryInfoSender
source: Sender
zh_cn: 发送者

# HistoryInfoSize
source: Size
zh_cn: 大小

# HistoryInfoTime
source: Time
zh_cn: 时间

# HistoryInfoTitle
source: File info
zh_cn: 文件信息

# HistoryOpenDirectory
source: Open folder
zh_cn: 打开目录

# HistoryOpenFile
source: Open file
zh_cn: 打开文件

# HistoryOpenReceiveHistory
source: Receive history
zh_cn: 接收历史

# HistoryShowInFolder
source: Show in File Explorer
zh_cn: 在文件管理器中显示

# HistoryTitle
source: Receive history
zh_cn: 接收历史

# IdentityLoading
source: Loading identity…
zh_cn: 正在载入身份…

# IncomingFileSummary
source: Wants to send you the file {file}.
zh_cn: 想要发送给你文件 {file}。

# IncomingItemsSummary
source: Wants to send you {count} items.
zh_cn: 想要发送给你 {count} 个项目。

# IncomingTextSummary
source: Wants to send you a text message.
zh_cn: 想要发送给你一条文本消息。

# InvalidIpAddress
source: Enter a valid IP address.
zh_cn: 请输入有效的 IP 地址。

# InvalidPort
source: Port must be between 1 and 65535.
zh_cn: 端口必须在 1 到 65535 之间。

source: IP address
zh_cn: IP 地址

# ItemsAdded
source: Added {count} items
zh_cn: 已添加 {count} 项

# MoreItems
source: {count} more…
zh_cn: 另外 {count} 项…

source: Name
zh_cn: 名称

# NavReceive
source: Receive
zh_cn: 接收

# NavSend
source: Send
zh_cn: 发送

# NavSettings
source: Settings
zh_cn: 设置

# NotificationIncomingTitle
source: Incoming transfer from {device}
zh_cn: 来自 {device} 的传输请求

# NotificationReceiveCompleteTitle
source: Receive complete
zh_cn: 接收完成

# NotificationReceiveCompleteOne
source: Received an item from {device}.
zh_cn: 已接收来自 {device} 的 1 个项目。

# NotificationReceiveCompleteMany
source: Received {count} items from {device}.
zh_cn: 已接收来自 {device} 的 {count} 个项目。

# NotificationSendCompleteTitle
source: Send complete
zh_cn: 发送完成

# NotificationSendCompleteOne
source: Sent an item to {device}.
zh_cn: 已向 {device} 发送 1 个项目。

# NotificationSendCompleteMany
source: Sent {count} items to {device}.
zh_cn: 已向 {device} 发送 {count} 个项目。

source: Nearby devices
zh_cn: 附近的设备

# NetworkStartFailed
source: Could not start the network service
zh_cn: 无法启动网络服务

# DiscoveryScanHint
source: Multicast discovery is unavailable. Nearby devices are found by scanning this network.
zh_cn: 多播发现不可用。正在通过扫描局域网查找附近设备。

# NodeDisconnected
source: Disconnected
zh_cn: 未连接

source: Network status
zh_cn: 网络状态

# NodeDiscoveryLimited
source: Connected; nearby search is using a network scan
zh_cn: 已连接；附近设备通过网络扫描查找

# NodeFaulted
source: Network service unavailable
zh_cn: 网络服务不可用

# NodeRunning
source: Connected to the local network
zh_cn: 已连接到本地网络

# NodeStarting
source: Starting…
zh_cn: 正在启动…

# NodeStopping
source: Stopping…
zh_cn: 正在停止…

source: Nothing selected
zh_cn: 尚未选择内容

# OptionSystem
source: Use system setting
zh_cn: 跟随系统

source: Page not found.
zh_cn: 找不到此页面。

# PendingRequests
source: {count} pending requests
zh_cn: {count} 个待处理请求

# PickFileFailed
source: Could not select file: {error}
zh_cn: 无法选择文件：{error}

# PickFolderFailed
source: Could not select folder: {error}
zh_cn: 无法选择文件夹：{error}

# PinIncorrect
source: Incorrect PIN. Try again.
zh_cn: PIN 不正确，请重试。

# PinPlaceholder
source: Enter PIN
zh_cn: 输入 PIN

# PinRateLimited
source: Too many PIN attempts. Try again later.
zh_cn: PIN 尝试次数过多，请稍后再试。

# PinRequiredMessage
source: {device} requires a receive PIN.
zh_cn: {device} 要求输入接收 PIN。

# PinRequiredTitle
source: PIN required
zh_cn: 需要 PIN

source: Port
zh_cn: 端口

# PortInUseHint
source: Check whether port 53317 is in use by Tonarink or another LocalSend-compatible app.
zh_cn: 请检查 53317 端口是否被 Tonarink 或其他兼容 LocalSend 的应用占用。

# PreparingForDevice
source: Preparing to send to {device}…
zh_cn: 正在准备发送给 {device}…

source: Receive cancelled
zh_cn: 接收已取消

# ReceivedMessage
source: Sent you a message:
zh_cn: 发送给你了一条消息：

source: Received text content
zh_cn: 收到的文本内容

source: Receive failed.
zh_cn: 接收失败。

# ReceiveTitle
source: Receive
zh_cn: 接收

source: Receiving content…
zh_cn: 正在接收内容…

# ReceivingPreparing
source: Preparing to receive…
zh_cn: 正在准备接收…

# RefreshDevices
source: Refresh nearby devices
zh_cn: 刷新附近设备

source: Remove
zh_cn: 移除

# RemoveFavoriteDevice
source: Remove {device} from favorites
zh_cn: 取消收藏 {device}

source: Remove {item}
zh_cn: 移除 {item}

source: Retry
zh_cn: 重试

# SameNetworkHint
source: Make sure the target device is connected to the same Wi-Fi network.
zh_cn: 请确保目标设备连接到同一个 Wi-Fi 网络。

source: Save
zh_cn: 保存

# SearchingDevices
source: Looking for nearby devices
zh_cn: 正在寻找附近设备

# SelectContentFirst
source: Choose something to send first.
zh_cn: 请先选择要发送的内容。

# SelectedItems
source: {count} items selected · {size}
zh_cn: 已选择 {count} 项 · {size}

source: Send cancelled
zh_cn: 发送已取消

source: Send failed
zh_cn: 发送失败

# SendHint
source: Choose content, then select a nearby device to send it.
zh_cn: 选择内容后，点击附近设备即可发送。

# SendingPreparing
source: Preparing to send…
zh_cn: 正在准备发送…

# SendingTitle
source: Sending
zh_cn: 正在发送

source: Sending to {device}…
zh_cn: 正在发送给 {device}…

# SendingTransferring
source: Transferring…
zh_cn: 正在传输…

# SendingWaiting
source: Waiting for a response…
zh_cn: 等待对方响应…

# SendTextPlaceholder
source: Enter text to send…
zh_cn: 输入要发送的文本…

# SendTextTitle
source: Send text
zh_cn: 发送文本

# SendTitle
source: Send
zh_cn: 发送

source: Send to {device}
zh_cn: 向 {device} 发送

# SentToDevice
source: Successfully sent to {device}.
zh_cn: 已成功发送给 {device}。

# SettingsAdvanced
source: Advanced settings
zh_cn: 高级设置

# SettingsAdvancedDescription
source: Device type, port, encryption, and other network options.
zh_cn: 设备类型、端口、加密等网络选项。

# SettingsAbout
source: About
zh_cn: 关于

# SettingsAboutCopyright
source: © {year}. All rights reserved.
zh_cn: © {year}。保留所有权利。

# SettingsAboutRelationship
source: Tonarink is an independent, unofficial implementation of the LocalSend protocol. It is not affiliated with or endorsed by the LocalSend project. Thanks to Tien Do Nam and the LocalSend contributors for creating and documenting the protocol.
zh_cn: Tonarink 是 LocalSend 协议的独立非官方实现，与 LocalSend 项目不存在从属、关联或官方认可关系。感谢 Tien Do Nam 与 LocalSend 贡献者创建并公开这一协议。

# SettingsAboutFeedback
source: Send feedback
zh_cn: 发送反馈

# SettingsAboutGitHub
source: GitHub repository
zh_cn: GitHub 仓库

# SettingsAboutIssues
source: Report an issue
zh_cn: 报告问题

# SettingsAboutLocalSend
source: LocalSend website
zh_cn: LocalSend 官网

# SettingsAboutVersion
source: Version {version}
zh_cn: 版本 {version}

# SettingsAutoSave
source: Auto save
zh_cn: 自动保存

# SettingsAutoSaveDescription
source: Automatically accept and save incoming content.
zh_cn: 自动接受并保存收到的内容。

# SettingsDeviceModel
source: Device model
zh_cn: 设备型号

# SettingsDeviceModelDescription
source: Optional model name advertised to other devices. Leave empty to use this computer''s name.
zh_cn: 向其他设备展示的型号。留空则使用此电脑的名称。

# SettingsDeviceName
source: Device name
zh_cn: 设备名称

# SettingsDeviceNameDescription
source: Other devices see this name. Restart the server to apply a change.
zh_cn: 其他设备将看到这个名称。更改后需重启服务器。

# SettingsDeviceType
source: Device type
zh_cn: 设备类型

# SettingsDeviceTypeDescription
source: Choose the icon other devices show for this computer.
zh_cn: 选择其他设备看到的图标，例如电脑或手机。

# SettingsDiscoveryTimeout
source: Discovery timeout
zh_cn: 搜索超时

# SettingsDiscoveryTimeoutDescription
source: How long each HTTP nearby-device probe waits, in milliseconds.
zh_cn: 每次用 HTTP 探测附近设备时等待的毫秒数。

# SettingsEncryption
source: Encryption
zh_cn: 加密

# SettingsEncryptionDescription
source: Use HTTPS and certificate identity for transfers.
zh_cn: 使用 HTTPS 和证书身份进行传输。

# SettingsEncryptionDisabledNotice
source: Encryption is off. Nearby devices will connect over HTTP, and identity checks are weaker. Restart the server to apply this.
zh_cn: 加密已关闭。附近设备将通过 HTTP 连接，身份校验会变弱。需重启服务器后生效。

# SettingsEncryptionDisabledTitle
source: Encryption disabled
zh_cn: 已关闭加密

# SettingsFavoritesOnly
source: Only auto-receive from favorites
zh_cn: 仅自动接收收藏设备

# SettingsFavoritesOnlyDescription
source: When auto save is on, trust only devices in your favorites.
zh_cn: 自动保存开启时，只信任收藏列表中的设备。

# SettingsGeneral
source: General
zh_cn: 通用

# SettingsLanguage
source: Language
zh_cn: 语言

# SettingsLanguageDescription
source: Change the language used by the interface.
zh_cn: 更改界面显示语言。

# SettingsNeedRestart
source: Settings changed. Restart the server to apply them.
zh_cn: 设置已更改。重启服务器后生效。

# SettingsNetwork
source: Network
zh_cn: 名称与网络

# SettingsNetworkInterfaces
source: Network interfaces
zh_cn: 网络接口

# SettingsNetworkInterfacesAll
source: All
zh_cn: 全部

# SettingsNetworkInterfacesBlacklist
source: Blacklist
zh_cn: 黑名单

# SettingsNetworkInterfacesEmpty
source: No IPv4 network interfaces were found.
zh_cn: 没有找到 IPv4 网络接口。

# SettingsNetworkInterfacesExample
source: Example:
zh_cn: 示例:

# SettingsNetworkInterfacesInfo
source: By default, Tonarink uses every available network interface. You can exclude networks you do not need. Restart the server to apply changes.
zh_cn: 默认情况下，Tonarink 使用所有可用的网络接口。您可以在此处排除不需要的网络。您需要重新启动服务器以应用更改。

# SettingsNetworkInterfacesPattern
source: Pattern {index}
zh_cn: 规则 {index}

# SettingsNetworkInterfacesPreview
source: Preview
zh_cn: 预览

# SettingsNetworkInterfacesRemovePattern
source: Remove pattern
zh_cn: 删除规则

# SettingsNetworkInterfacesWhitelist
source: Whitelist
zh_cn: 白名单

# SettingsPort
source: Port
zh_cn: 端口

# SettingsPortDescription
source: TCP and UDP port used by Tonarink''s LocalSend-compatible service.
zh_cn: Tonarink 的 LocalSend 兼容服务使用的 TCP 和 UDP 端口。

# SettingsPortWarning
source: Custom port. Other devices still look for {port} unless they are changed too.
zh_cn: 正在使用自定义端口。其他设备默认仍会查找 {port}，除非也改成相同值。

# SettingsMulticast
source: Multicast
zh_cn: 多播

# SettingsMulticastDescription
source: IPv4 multicast group used to announce this device.
zh_cn: 用于宣告本机的 IPv4 多播组。

# SettingsMulticastWarning
source: Custom multicast group. Other LocalSend-compatible devices expect {group} unless they are changed too.
zh_cn: 正在使用自定义多播组。其他兼容 LocalSend 的设备默认使用 {group}，除非也改成相同值。

# SettingsMinimizeToTray
source: Minimize to the system tray when closing
zh_cn: 关闭时最小化到系统托盘

# SettingsMinimizeToTrayDescription
source: Keep receiving in the background when the main window closes.
zh_cn: 关闭主窗口时继续在后台接收。

# SettingsReceive
source: Receive
zh_cn: 接收

# SettingsRestartServer
source: Restart server
zh_cn: 重启服务器

# SettingsSaveLocation
source: Save location
zh_cn: 保存位置

# SettingsServerOffline
source: Server (offline)
zh_cn: 服务器（已停止）

# SettingsServerRunning
source: The receive service is running.
zh_cn: 接收服务正在运行。

# SettingsServerStopped
source: The receive service is stopped.
zh_cn: 接收服务已停止。

# SettingsStartServer
source: Start server
zh_cn: 启动服务器

# SettingsStopServer
source: Stop server
zh_cn: 停止服务器

# SettingsStartWithWindows
source: Start after signing in
zh_cn: 登录系统后自动启动

# SettingsStartWithWindowsDescription
source: Run Tonarink automatically after signing in to Windows.
zh_cn: 登录 Windows 后自动运行 Tonarink。

# ExplorerCommandTitle
source: Send with Tonarink
zh_cn: 使用 Tonarink 发送

# SettingsExplorerContextMenu
source: Show in File Explorer
zh_cn: 在文件资源管理器中显示

# SettingsExplorerContextMenuDescription
source: Add “Send with Tonarink” to the Windows 11 context menu. Applies to the packaged app.
zh_cn: 在 Windows 11 右键菜单中加入“使用 Tonarink 发送”。安装打包版本后生效。

# StartupDisabledByPolicy
source: Windows policy is blocking Tonarink from starting at sign-in.
zh_cn: 当前 Windows 策略禁止 Tonarink 在登录后自动启动。

# StartupDisabledByUser
source: Startup was turned off in Windows Settings. Enable Tonarink there, then try again.
zh_cn: 已在 Windows 设置中关闭开机启动。请先在系统设置里启用 Tonarink，然后再试。

# StartupFailed
source: Could not update sign-in startup: {error}
zh_cn: 无法更新登录后自动启动：{error}

# TrayExit
source: Exit
zh_cn: 退出

# TrayOpen
source: Open Tonarink
zh_cn: 打开 Tonarink

# SettingsTheme
source: Theme
zh_cn: 主题

# SettingsThemeDescription
source: Choose the app''s light or dark appearance.
zh_cn: 选择应用的明暗外观。

# SettingsTitle
source: Settings
zh_cn: 设置

# ShareTargetEmpty
source: The share did not contain any accessible files or text.
zh_cn: 分享内容中没有可访问的文件或文本。

# ShareTargetFailed
source: Could not add the shared content: {error}
zh_cn: 无法添加分享内容：{error}

# Tagline
source: An unofficial LocalSend-compatible app
zh_cn: LocalSend 协议的非官方兼容实现

source: Target device
zh_cn: 目标设备

# TargetRequiresPin
source: The target device requires a PIN.
zh_cn: 目标设备要求 PIN。

source: Text
zh_cn: 文本

# TextAvailableAfterAccept
source: The complete text will appear after you accept.
zh_cn: 接受后将显示完整文本。

source: Text content
zh_cn: 文本内容

source: Text message
zh_cn: 文本消息

source: Text received.
zh_cn: 文本接收完成。

# ThemeDark
source: Dark
zh_cn: 深色

# ThemeLight
source: Light
zh_cn: 浅色

source: This device
zh_cn: 本机

source: Transfer cancelled
zh_cn: 传输已取消

source: Transfer complete
zh_cn: 发送完成

source: Transfer failed.
zh_cn: 传输失败。

# TransferPreparing
source: Preparing
zh_cn: 正在准备

# TransferTransferring
source: Transferring
zh_cn: 正在传输

# TransferWaiting
source: Waiting for acceptance
zh_cn: 等待接受

# WaitingForDevice
source: Waiting for {device} to accept…
zh_cn: 正在等待 {device} 接受…

# WebShareAccepted
source: Accepted
zh_cn: 已接受

# WebShareAutoAccept
source: Auto accept requests
zh_cn: 自动接受请求

# WebShareCopy
source: Copy link
zh_cn: 复制链接

# WebShareEncryption
source: Encryption
zh_cn: 加密

# WebShareEncryptionHint
source: HTTPS uses this device's certificate. Browsers will warn that it is not trusted.
zh_cn: HTTPS 使用此设备的证书。浏览器会提示该证书不受信任。

# WebShareNoRequests
source: No requests yet.
zh_cn: 尚无请求。

# WebShareOpenLink
source: Open this link in a browser:
zh_cn: 在浏览器中打开链接：

# WebSharePinHint
source: PIN is "{pin}"
zh_cn: PIN 为 “{pin}”

# WebShareQr
source: QR code
zh_cn: 二维码

# WebShareQrTitle
source: QR code
zh_cn: 二维码

# WebShareRequests
source: Requests
zh_cn: 请求

# WebShareRequirePin
source: Require a PIN
zh_cn: 需要一个 PIN

# WebShareTitle
source: Share via link
zh_cn: 分享为链接

# WebReceiveTitle
source: Receive via link
zh_cn: 通过链接接收

# WebShareZoom
source: Show large link
zh_cn: 放大显示链接

# WebShareZoomTitle
source: Link
zh_cn: 链接

# WantsToSendMessage
source: Wants to send you a message:
zh_cn: 想要发送给你一条消息：

# WindowUnavailable
source: The current Reactor window is unavailable.
zh_cn: 当前 Reactor 窗口不可用。
